EduardoHM98/LoRaMac-node/src/boards/mcu/stm32/BlueNRG-LP/inc/rf_driver_ll_pwr.h
/**
  ******************************************************************************
  * @file    rf_driver_ll_pwr.h
  * @author  RF Application Team
  * @brief   Header file of PWR LL module.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2018 STMicroelectronics. 
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the 
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef RF_DRIVER_LL_PWR_H
#define RF_DRIVER_LL_PWR_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "bluenrg_lpx.h"
/** @addtogroup RF_DRIVER_LL_Driver
  * @{
  */

#if defined(PWR)

/** @defgroup PWR_LL PWR
  * @{
  */

/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/

/* Private constants ---------------------------------------------------------*/

/* Private macros ------------------------------------------------------------*/

/* Exported types ------------------------------------------------------------*/
/* Exported constants --------------------------------------------------------*/
/** @defgroup PWR_LL_Exported_Constants PWR Exported Constants
  * @{
  */

/** @defgroup PWR_LL_EC_MODE_PWR MODE PWR
  * @{
  */
#define LL_PWR_MODE_DEEPSTOP               (0x000000000U)
#define LL_PWR_MODE_SHUTDOWN               (PWR_CR1_LPMS)
/**
  * @}
  */

/** @defgroup PWR_LL_EC_RAMRET RAM Retention enable
  * @{
  */
#define LL_PWR_RAMRET_1    PWR_CR2_RAMRET1
#if defined(PWR_CR2_RAMRET2)
#define LL_PWR_RAMRET_2    PWR_CR2_RAMRET2
#endif
#if defined(PWR_CR2_RAMRET3)
#define LL_PWR_RAMRET_3    PWR_CR2_RAMRET3
#endif
/**
  * @}
  */

/** @defgroup PWR_LL_EC_PVDLEVEL PVDLEVEL
  * @{
  */
#define LL_PWR_PVDLEVEL_0                  (0x00000000U)                                     /* VPVD0 around 2.0 V */
#define LL_PWR_PVDLEVEL_1                  (PWR_CR2_PVDLS_0)                                 /* VPVD1 around 2.2 V */
#define LL_PWR_PVDLEVEL_2                  (PWR_CR2_PVDLS_1)                                 /* VPVD2 around 2.4 V */
#define LL_PWR_PVDLEVEL_3                  (PWR_CR2_PVDLS_1 | PWR_CR2_PVDLS_0)               /* VPVD3 around 2.5 V */
#define LL_PWR_PVDLEVEL_4                  (PWR_CR2_PLVDS_2)                                 /* VPVD4 around 2.6 V */
#define LL_PWR_PVDLEVEL_5                  (PWR_CR2_PVDLS_2 | PWR_CR2_PVDLS_0)               /* VPVD5 around 2.8 V */
#define LL_PWR_PVDLEVEL_6                  (PWR_CR2_PVDLS_2 | PWR_CR2_PVDLS_1)               /* VPVD6 around 2.9 V */
#define LL_PWR_PVDLEVEL_7                  (PWR_CR2_PVDLS)                                   /* External input analog voltage   (Compare internally to VBGP) */
/**
  * @}
  */

/** @defgroup PWR_LL_EW_SOURCE_PORT IO Port for wakeup source 
  * @{
*/
#define LL_PWR_EWS_PORTA   (0x00000000U)                                     /* IO port A to get out from DEEPSTOP mode */
#define LL_PWR_EWS_PORTB   (0x00000001U)                                     /* IO port B to get out from DEEPSTOP mode */
/**
  * @}
  */

/** @defgroup PWR_LL_EW_SOURCE Enable Wakeup Source
  * @{
  */
#define LL_PWE_EWS_ALL            0xFFFFFFFF                /* Enable all the wakeup source                   */
#define LL_PWR_EWS_INT            PWR_CR3_EIWL              /* Enable wakeup on Internal event (RTC)          */
#if defined(PWR_CR3_EIWL2)
#define LL_PWR_EWS_INT2           PWR_CR3_EIWL2             /* Enable wakeup on Internal event 2 (LPUART)     */
#endif
#define LL_PWR_EWS_BLEHOST        PWR_CR3_EWBLEHCPU         /* Enable wakeup on BLE Host CPU event            */
#define LL_PWR_EWS_BLE            PWR_CR3_EWBLE             /* Enable wakeup on BLE event                     */
#define LL_PWE_EWS_EW11           PWR_CR3_EWU11             /* Enable wakeup on PA11 I/O event                */
#define LL_PWE_EWS_EW10           PWR_CR3_EWU10             /* Enable wakeup on PA10 I/O event                */
#define LL_PWE_EWS_EW9            PWR_CR3_EWU9              /* Enable wakeup on PA9 I/O event                 */
#define LL_PWE_EWS_EW8            PWR_CR3_EWU8              /* Enable wakeup on PA8 I/O event                 */
#define LL_PWE_EWS_EW7            PWR_CR3_EWU7              /* Enable wakeup on PB7 I/O event                 */
#define LL_PWE_EWS_EW6            PWR_CR3_EWU6              /* Enable wakeup on PB6 I/O event                 */
#define LL_PWE_EWS_EW5            PWR_CR3_EWU5              /* Enable wakeup on PB5 I/O event                 */
#define LL_PWE_EWS_EW4            PWR_CR3_EWU4              /* Enable wakeup on PB4 I/O event                 */
#define LL_PWE_EWS_EW3            PWR_CR3_EWU3              /* Enable wakeup on PB3 I/O event                 */
#define LL_PWE_EWS_EW2            PWR_CR3_EWU2              /* Enable wakeup on PB2 I/O event                 */
#define LL_PWE_EWS_EW1            PWR_CR3_EWU1              /* Enable wakeup on PB1 I/O event                 */
#define LL_PWE_EWS_EW0            PWR_CR3_EWU0              /* Enable wakeup on PB0 I/O event                 */
#if defined(PWR_CR6_EWU27)
#define LL_PWE_EWS_EW27           (PWR_CR6_EWU27 << 16)     /* Enable wakeup on PA15 I/O event                */
#endif
#if defined(PWR_CR6_EWU26)
#define LL_PWE_EWS_EW26           (PWR_CR6_EWU26 << 16)     /* Enable wakeup on PA14 I/O event                */
#endif
#if defined(PWR_CR6_EWU25) 
#define LL_PWE_EWS_EW25           (PWR_CR6_EWU25 << 16)     /* Enable wakeup on PA13 I/O event                */
#endif
#if defined(PWR_CR6_EWU24)
#define LL_PWE_EWS_EW24           (PWR_CR6_EWU24 << 16)     /* Enable wakeup on PA12 I/O event                */
#endif
#if defined(PWR_CR6_EWU23)
#define LL_PWE_EWS_EW23           (PWR_CR6_EWU23 << 16)     /* Enable wakeup on PB11 I/O event                */
#endif
#if defined(PWR_CR6_EWU22)
#define LL_PWE_EWS_EW22           (PWR_CR6_EWU22 << 16)     /* Enable wakeup on PB10 I/O event                */
#endif
#if defined(PWR_CR6_EWU21)
#define LL_PWE_EWS_EW21           (PWR_CR6_EWU21 << 16)     /* Enable wakeup on PB9 I/O event                 */
#endif
#if defined(PWR_CR6_EWU20)
#define LL_PWE_EWS_EW20           (PWR_CR6_EWU20 << 16)     /* Enable wakeup on PB8 I/O event                 */
#endif
#define LL_PWE_EWS_EW19           (PWR_CR6_EWU19 << 16)     /* Enable wakeup on LP-PA7 or LPS-PB15 I/O event  */
#define LL_PWE_EWS_EW18           (PWR_CR6_EWU18 << 16)     /* Enable wakeup on LP-PA6 or LPS-PB14 I/O event  */
#define LL_PWE_EWS_EW17           (PWR_CR6_EWU17 << 16)     /* Enable wakeup on LP-PA5 or LPS-PB13 I/O event  */
#define LL_PWE_EWS_EW16           (PWR_CR6_EWU16 << 16)     /* Enable wakeup on LP-PA4 or LPS-PB12 I/O event  */
#define LL_PWE_EWS_EW15           (PWR_CR6_EWU15 << 16)     /* Enable wakeup on PA3 I/O event                 */
#define LL_PWE_EWS_EW14           (PWR_CR6_EWU14 << 16)     /* Enable wakeup on PA2 I/O event                 */
#define LL_PWE_EWS_EW13           (PWR_CR6_EWU13 << 16)     /* Enable wakeup on PA1 I/O event                 */
#define LL_PWE_EWS_EW12           (PWR_CR6_EWU12 << 16)     /* Enable wakeup on PA0 I/O event                 */

/**
  * @}
  */
  
/** @defgroup PWR_LL_EC_IO_CFG IOs PU/PD configuration
  * @{
  */
#define LL_PWR_PUPD_IO0          (uint32_t)(1U << 0U)     /*!< IO0  */
#define LL_PWR_PUPD_IO1          (uint32_t)(1U << 1U)     /*!< IO1  */
#define LL_PWR_PUPD_IO2          (uint32_t)(1U << 2U)     /*!< IO2  */
#define LL_PWR_PUPD_IO3          (uint32_t)(1U << 3U)     /*!< IO3  */
#define LL_PWR_PUPD_IO4          (uint32_t)(1U << 4U)     /*!< IO4  */
#define LL_PWR_PUPD_IO5          (uint32_t)(1U << 5U)     /*!< IO5  */
#define LL_PWR_PUPD_IO6          (uint32_t)(1U << 6U)     /*!< IO6  */
#define LL_PWR_PUPD_IO7          (uint32_t)(1U << 7U)     /*!< IO7  */
#define LL_PWR_PUPD_IO8          (uint32_t)(1U << 8U)     /*!< IO8  */
#define LL_PWR_PUPD_IO9          (uint32_t)(1U << 9U)     /*!< IO9  */
#define LL_PWR_PUPD_IO10         (uint32_t)(1U << 10U)    /*!< IO10  */
#define LL_PWR_PUPD_IO11         (uint32_t)(1U << 11U)    /*!< IO11  */
#define LL_PWR_PUPD_IO12         (uint32_t)(1U << 12U)    /*!< IO12  */
#define LL_PWR_PUPD_IO13         (uint32_t)(1U << 13U)    /*!< IO13  */
#define LL_PWR_PUPD_IO14         (uint32_t)(1U << 14U)    /*!< IO14  */
#define LL_PWR_PUPD_IO15         (uint32_t)(1U << 15U)    /*!< IO15  */
/**
  * @}
  */

/** @defgroup PWR_LL_EC_IO_CFG IOs PU/PD configuration
  * @{
  */
#define LL_PWR_WUP_RISIEDG (0x000000000U)   /* Detection of wakeup event on rising edge. */
#define LL_PWR_WUP_FALLEDG (0x000000001U)   /* Detection of wakeup event on falling edge. */
/**
  * @}
  */

