EduardoHM98/LoRaMac-node/src/boards/mcu/stm32/BlueNRG-LP/inc/rf_driver_ll_pwr.h
/** @defgroup PWR_LL_EC_IO_OUT_CFG PA4-PA11 output configuration during DEEPSTOP
  * @{
  */
#define LL_PWR_IOCFG_BYP        (0x000000000U)   /* BYPASS mode. The I/O mode is controlled by the GPIO block 
                                                    registers in active mode and switch to input mode 
                                                    during DEESPTOP state.                                        */
#define LL_PWR_IOCFG_RTC        (0x000000001U)   /* RTC_OUT signal for PA11 and PA8 */
#define LL_PWR_IOCFG_LCO        (0x000000001U)   /* LCO output signal for PA10 and PA9 */
#define LL_PWR_IOCFG_LOW        (0x000000002U)   /* I/O drives a low level in both active and DEEPSTOP modes      */
#define LL_PWR_IOCFG_HIGH       (0x000000003U)   /* I/O drives a high level in both active and DEEPSTOP modes     */
/**
  * @}
  */

/** @defgroup PWR_LL_EC_IO_LATCH_BOOT PA8-PA11 I/Os value latched at POR.
  * @{
  */
#define LL_PWR_PA8_LATCH_POR    PWR_SR2_IOBOOTVAL_0 /* PA8  input value latched at POR. */
#define LL_PWR_PA9_LATCH_POR    PWR_SR2_IOBOOTVAL_1 /* PA9  input value latched at POR. */
#define LL_PWR_PA10_LATCH_POR   PWR_SR2_IOBOOTVAL_2 /* PA10 input value latched at POR. */
#define LL_PWR_PA11_LATCH_POR   PWR_SR2_IOBOOTVAL_3 /* PA11 input value latched at POR. */
/**
  * @}
  */
    
/** @defgroup PWR_LL_EC_IO_LATCH_BOOT PB12-PB15 I/Os value latched at POR.
  * @{
  */
#if defined(PWR_SR2_IOBOOTVAL2_0)
#define LL_PWR_PB12_LATCH_POR   PWR_SR2_IOBOOTVAL2_0 /* PB12  input value latched at POR. */
#endif
#if defined(PWR_SR2_IOBOOTVAL2_1)
#define LL_PWR_PB13_LATCH_POR   PWR_SR2_IOBOOTVAL2_1 /* PB13  input value latched at POR. */
#endif
#if defined(PWR_SR2_IOBOOTVAL2_2)
#define LL_PWR_PB14_LATCH_POR   PWR_SR2_IOBOOTVAL2_2 /* PB14  input value latched at POR. */
#endif
#if defined(PWR_SR2_IOBOOTVAL2_3)
#define LL_PWR_PB15_LATCH_POR   PWR_SR2_IOBOOTVAL2_3 /* PB15  input value latched at POR. */
#endif
/**
  * @}
  */

/** @defgroup PWR_LL_EC_SMPS_MODE SMPS Mode
  * @{
  */
#define LL_PWR_SMPS       (0x000000000U)   /* SMPS is enabled     */
#define LL_PWR_NO_SMPS    PWR_CR5_NOSMPS   /* SMPS is disabled    */
/**
  * @}
  */
  
/** @defgroup PWR_LL_EC_SMPS_PRECHARGE_MODE SMPS PRECHARGE Mode
  * @{
  */
#define LL_PWR_NO_SMPS_PRECHARGE    (0x000000000U)     /* SMPS not in pecharge mode     */
#define LL_PWR_SMPS_PRECHARGE       PWR_CR5_SMPSFBYP   /* SMPS is disabled and bypassed in precharge mode    */
/**
  * @}
  */

/** @defgroup PWR_LL_EC_SMPS_OPEN_MODE SMPS OPEN Mode during DEEPSTOP
  * @{
  */
#define LL_PWR_NO_SMPS_LPOPEN    (0x000000000U)      /* In DEEPSTOP, the SMPS is in PRECHARGE mode with output connected to VDDIO */
#define LL_PWR_SMPS_LPOPEN       PWR_CR5_SMPSLPOPEN  /* In DEEPSTOP, the SMPS is disabled with floating output                    */
/**
  * @}
  */

/** @defgroup PWR_LL_EC_SMPS_BOM SMPS BOM
  * @{
  */
#define LL_PWR_SMPS_BOM1       (0x000000000U)        
#define LL_PWR_SMPS_BOM2       PWR_CR5_SMPSBOMSEL_0  
#define LL_PWR_SMPS_BOM3       PWR_CR5_SMPSBOMSEL_1  
/**
  * @}
  */

/** @defgroup PWR_LL_EC_SMPS_OUTLVL SMPS Output Level
  * @{
  */
#define LL_PWR_SMPS_OUTLVL_1V2               (0x000000000U)
#define LL_PWR_SMPS_OUTLVL_1V25              (PWR_CR5_SMPSLVL_0)
#define LL_PWR_SMPS_OUTLVL_1V3               (PWR_CR5_SMPSLVL_1)
#define LL_PWR_SMPS_OUTLVL_1V35              (PWR_CR5_SMPSLVL_1|PWR_CR5_SMPSLVL_0)
#define LL_PWR_SMPS_OUTLVL_1V4               (PWR_CR5_SMPSLVL_2)
#define LL_PWR_SMPS_OUTLVL_1V45              (PWR_CR5_SMPSLVL_2|PWR_CR5_SMPSLVL_0)
#define LL_PWR_SMPS_OUTLVL_1V5               (PWR_CR5_SMPSLVL_2|PWR_CR5_SMPSLVL_1)
#define LL_PWR_SMPS_OUTLVL_1V55              (PWR_CR5_SMPSLVL_2|PWR_CR5_SMPSLVL_1|PWR_CR5_SMPSLVL_0)
#define LL_PWR_SMPS_OUTLVL_1V6               (PWR_CR5_SMPSLVL_3)
#define LL_PWR_SMPS_OUTLVL_1V65              (PWR_CR5_SMPSLVL_3|PWR_CR5_SMPSLVL_0)
#define LL_PWR_SMPS_OUTLVL_1V7               (PWR_CR5_SMPSLVL_3|PWR_CR5_SMPSLVL_1)
#define LL_PWR_SMPS_OUTLVL_1V75              (PWR_CR5_SMPSLVL_3|PWR_CR5_SMPSLVL_1|PWR_CR5_SMPSLVL_0)
#define LL_PWR_SMPS_OUTLVL_1V8               (PWR_CR5_SMPSLVL_3|PWR_CR5_SMPSLVL_2)
#define LL_PWR_SMPS_OUTLVL_1V85              (PWR_CR5_SMPSLVL_3|PWR_CR5_SMPSLVL_2|PWR_CR5_SMPSLVL_0)
#define LL_PWR_SMPS_OUTLVL_1V9               (PWR_CR5_SMPSLVL_3|PWR_CR5_SMPSLVL_2|PWR_CR5_SMPSLVL_1)
#define LL_PWR_SMPS_OUTLVL_1V95              (PWR_CR5_SMPSLVL)
/**
  * @}
  */

#if defined(PWR_CR5_SMPS_PRECH_CUR_SEL)
/** @defgroup PWR_LL_EC_SMPS_PRECHARGE_LIMIT_CURRENT Select SMPS PRECHARGE limit current
  * @{
  */
#define LL_PWR_SMPS_PRECH_LIMIT_CUR_2_5     (0x000000000U)
#define LL_PWR_SMPS_PRECH_LIMIT_CUR_5       (PWR_CR5_SMPS_PRECH_CUR_SEL_0)
#define LL_PWR_SMPS_PRECH_LIMIT_CUR_10      (PWR_CR5_SMPS_PRECH_CUR_SEL_1)
#define LL_PWR_SMPS_PRECH_LIMIT_CUR_20      (PWR_CR5_SMPS_PRECH_CUR_SEL_0|PWR_CR5_SMPS_PRECH_CUR_SEL_1)
/**
  * @}
  */
#endif

/**
  * @}
  */

/* Exported macro ------------------------------------------------------------*/
/** @defgroup PWR_LL_Exported_Macros PWR Exported Macros
  * @{
  */

/** @defgroup PWR_LL_EM_WRITE_READ Common Write and read registers Macros
  * @{
  */

/**
  * @brief  Write a value in PWR register
  * @param  __REG__ Register to be written
  * @param  __VALUE__ Value to be written in the register
  * @retval None
  */
#define LL_PWR_WriteReg(__REG__, __VALUE__) WRITE_REG(PWR->__REG__, (__VALUE__))

/**
  * @brief  Read a value in PWR register
  * @param  __REG__ Register to be read
  * @retval Register value
  */
#define LL_PWR_ReadReg(__REG__) READ_REG(PWR->__REG__)
/**
  * @}
  */

/**
  * @}
  */


/* Exported functions --------------------------------------------------------*/
/** @defgroup PWR_LL_Exported_Functions PWR Exported Functions
  * @{
  */

/** @defgroup PWR_LL_EF_Configuration Configuration
  * @{
  */

/**
  * @brief  Enable the BOR reset supervising during SHUTDOWN mode.
  * @rmtoll CR1          ENSDNBOR           LL_PWR_EnableBORinSDN
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableBORinSDN(void)
{
  SET_BIT(PWR->CR1, PWR_CR1_ENSDNBOR);
}

/**
  * @brief  Disable the BOR reset supervising during SHUTDOWN mode.
  * @rmtoll CR1          ENSDNBOR           LL_PWR_DisableBORinSDN
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableBORinSDN(void)
{
  CLEAR_BIT(PWR->CR1, PWR_CR1_ENSDNBOR);
}

/**
  * @brief  Checks if BOR is enabled or disabled during SHUTDOWN mode.
  * @rmtoll CR1         ENSDNBOR      LL_PWR_IsEnabledBORinSDN
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledBORinSDN(void)
{
  return ((READ_BIT(PWR->CR1, PWR_CR1_ENSDNBOR) == (PWR_CR1_ENSDNBOR)) ? 1UL : 0UL);
}

/**
  * @brief  Select the low-power mode.
  * @rmtoll CR1          LPMS           LL_PWR_LowPowerMode
  * @param  selection Low Power Mode Selection. This parameter can be one of the following values:
  *         @arg @ref LL_PWR_MODE_DEEPSTOP
  *         @arg @ref LL_PWR_MODE_SHUTDOWN
  * @retval None
  */
__STATIC_INLINE void LL_PWR_LowPowerMode(uint32_t selection)
{
  SET_BIT(PWR->CR1, selection);
}

#if defined(PWR_CR2_LSILPMUFEN)
/**
  * @brief  LSI always enabled. Instead to be enabled/disabled by hardware depending
  *         on the analog LPMU block needs.
  * @rmtoll CR2          LSILPMUFEN           LL_PWR_EnableLSILPMU
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableLSILPMU(void)
{
  SET_BIT(PWR->CR2, PWR_CR2_LSILPMUFEN);
}

/**
  * @brief  Disable the LSI always enabled. With this setting the LSI LPMU is automatically enabled/disabled
  *         by hardware depending on the analog LPMU block needs.
  * @rmtoll CR2          LSILPMUFEN           LL_PWR_DisableLSILPMU
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableLSILPMU(void)
{
  CLEAR_BIT(PWR->CR2, PWR_CR2_LSILPMUFEN);
}

/**
  * @brief  Checks if LSI LPMU is enabled or disabled.
  * @rmtoll CR2         LSILPMUFEN     LL_PWR_IsEnabledLSILPMU
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledLSILPMU(void)
{
  return ((READ_BIT(PWR->CR2, PWR_CR2_LSILPMUFEN) == (PWR_CR2_LSILPMUFEN)) ? 1UL : 0UL);
}
#endif

