EduardoHM98/LoRaMac-node/src/boards/mcu/stm32/BlueNRG-LP/inc/rf_driver_ll_pwr.h
#if defined(PWR_CR2_ENTS)
/**
  * @brief  Enabled the temperature sensor.
  * @rmtoll CR2          ENTS           LL_PWR_EnableTempSens
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableTempSens(void)
{
  SET_BIT(PWR->CR2, PWR_CR2_ENTS);
}

/**
  * @brief  Disable the temperature sensor.
  * @rmtoll CR2          ENTS           LL_PWR_DisableTempSens
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableTempSens(void)
{
  CLEAR_BIT(PWR->CR2, PWR_CR2_ENTS);
}

/**
  * @brief  Checks if temperature sensor is enabled or disabled.
  * @rmtoll CR2         ENTS     LL_PWR_IsEnabledTempSens
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledTempSens(void)
{
  return ((READ_BIT(PWR->CR2, PWR_CR2_ENTS) == (PWR_CR2_ENTS)) ? 1UL : 0UL);
}
#endif

/**
  * @brief  Enable the RAM bank retention.
  * @rmtoll CR2         RAMRET1/RAMRET2/RAMRET3      LL_PWR_EnableRAMBankRet
  * @param  banks RAM bank selection. This parameter can be a combination of the following values:
  *         @arg @ref LL_PWR_RAMRET_1
  *         @arg @ref LL_PWR_RAMRET_2
  *         @arg @ref LL_PWR_RAMRET_3
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableRAMBankRet(uint32_t banks)
{
  SET_BIT(PWR->CR2, banks);
}

/**
  * @brief  Get the RAM banks retention selected.
  * @rmtoll CR2         RAMRET1/RAMRET2/RAMRET3      LL_PWR_GetRAMBankRet
  * @retval RAM bank selection. This parameter can be a combination of the following values:
  *         @arg @ref LL_PWR_RAMRET_1
  *         @arg @ref LL_PWR_RAMRET_2
  *         @arg @ref LL_PWR_RAMRET_3
  */
__STATIC_INLINE uint32_t LL_PWR_GetRAMBankRet(void)
{
  uint32_t ram_ret;
  
  ram_ret = READ_BIT(PWR->CR2, (PWR_CR2_RAMRET1));
#if defined(PWR_CR2_RAMRET2)
  ram_ret |= READ_BIT(PWR->CR2, (PWR_CR2_RAMRET2));
#endif
#if defined(PWR_CR2_RAMRET3)
  ram_ret |= READ_BIT(PWR->CR2, (PWR_CR2_RAMRET3));
#endif  
  return ram_ret;
}

/**
  * @brief  Disable the RAM bank retention.
  * @rmtoll CR2         RAMRET1/RAMRET2/RAMRET3      LL_PWR_DisableRAMBankRet
  * @param  banks RAM bank selection. This parameter can be a combination of the following values:
  *         @arg @ref LL_PWR_RAMRET_1
  *         @arg @ref LL_PWR_RAMRET_2
  *         @arg @ref LL_PWR_RAMRET_3
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableRAMBankRet(uint32_t banks)
{
  CLEAR_BIT(PWR->CR2, banks);
}

/**
  * @brief  Enable the PVD (Programmable Voltage Detector).
  * @rmtoll CR2          PVDE           LL_PWR_EnablePVD
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnablePVD(void)
{
  SET_BIT(PWR->CR2, PWR_CR2_PVDE);
}

/**
  * @brief  Disable the PVD (Programmable Voltage Detector).
  * @rmtoll CR2          PVDE           LL_PWR_DisablePVD
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisablePVD(void)
{
  CLEAR_BIT(PWR->CR2, PWR_CR2_PVDE);
}

/**
  * @brief  Checks if PVD is enabled or disabled.
  * @rmtoll CR2         PVDE      LL_PWR_IsEnabledPVD
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledPVD(void)
{
  return ((READ_BIT(PWR->CR2, PWR_CR2_PVDE) == (PWR_CR2_PVDE)) ? 1UL : 0UL);
}

/**
  * @brief  Set PVD voltage level.
  * @rmtoll CR2         PVDLS      LL_PWR_SetPVDLevel
  * @param  level PVD voltage level selection. This parameter can be one of the following values:
  *         @arg @ref LL_PWR_PVDLEVEL_0
  *         @arg @ref LL_PWR_PVDLEVEL_1
  *         @arg @ref LL_PWR_PVDLEVEL_2
  *         @arg @ref LL_PWR_PVDLEVEL_3
  *         @arg @ref LL_PWR_PVDLEVEL_4
  *         @arg @ref LL_PWR_PVDLEVEL_5
  *         @arg @ref LL_PWR_PVDLEVEL_6
  *         @arg @ref LL_PWR_PVDLEVEL_7
  * @retval None
  */
__STATIC_INLINE void LL_PWR_SetPVDLevel(uint32_t level)
{
  MODIFY_REG(PWR->CR2, PWR_CR2_PVDLS, level);
}

/**
  * @brief  Get PVD voltage level.
  * @rmtoll CR2         PVDLS      LL_PWR_GetPVDLevel
  * @retval PVD voltage level selection. The parameter can be one of the following values:
  *         @arg @ref LL_PWR_PVDLEVEL_0
  *         @arg @ref LL_PWR_PVDLEVEL_1
  *         @arg @ref LL_PWR_PVDLEVEL_2
  *         @arg @ref LL_PWR_PVDLEVEL_3
  *         @arg @ref LL_PWR_PVDLEVEL_4
  *         @arg @ref LL_PWR_PVDLEVEL_5
  *         @arg @ref LL_PWR_PVDLEVEL_6
  *         @arg @ref LL_PWR_PVDLEVEL_7
  */
__STATIC_INLINE uint32_t LL_PWR_GetPVDLevel(void)
{
  return (uint32_t)(READ_BIT(PWR->CR2, PWR_CR2_PVDLS));
}

/**
  * @brief  Enable Wakeup Source to get out of DEEPSTOP mode.
  * @rmtoll CR3/CR6               LL_PWR_EnableWakeupSource
  * @param  wakeup_sources Enable the wakeup sources. This parameter can be a combination of the following values:
  *         @arg @ref LL_PWR_EWS_INT
  *         @arg @ref LL_PWR_EWS_INT2
  *         @arg @ref LL_PWR_EWS_BLEHOST 
  *         @arg @ref LL_PWR_EWS_BLE     
  *         @arg @ref LL_PWE_EWS_EW27
  *         @arg @ref LL_PWE_EWS_EW26
  *         @arg @ref LL_PWE_EWS_EW25
  *         @arg @ref LL_PWE_EWS_EW24
  *         @arg @ref LL_PWE_EWS_EW23
  *         @arg @ref LL_PWE_EWS_EW22
  *         @arg @ref LL_PWE_EWS_EW21
  *         @arg @ref LL_PWE_EWS_EW20
  *         @arg @ref LL_PWE_EWS_EW19
  *         @arg @ref LL_PWE_EWS_EW18
  *         @arg @ref LL_PWE_EWS_EW17
  *         @arg @ref LL_PWE_EWS_EW16
  *         @arg @ref LL_PWE_EWS_EW15
  *         @arg @ref LL_PWE_EWS_EW14
  *         @arg @ref LL_PWE_EWS_EW13
  *         @arg @ref LL_PWE_EWS_EW12
  *         @arg @ref LL_PWE_EWS_EW11    
  *         @arg @ref LL_PWE_EWS_EW10    
  *         @arg @ref LL_PWE_EWS_EW9     
  *         @arg @ref LL_PWE_EWS_EW8     
  *         @arg @ref LL_PWE_EWS_EW7     
  *         @arg @ref LL_PWE_EWS_EW6     
  *         @arg @ref LL_PWE_EWS_EW5     
  *         @arg @ref LL_PWE_EWS_EW4     
  *         @arg @ref LL_PWE_EWS_EW3     
  *         @arg @ref LL_PWE_EWS_EW2     
  *         @arg @ref LL_PWE_EWS_EW1     
  *         @arg @ref LL_PWE_EWS_EW0
  * @retval None
  *         LL_PWE_EWS_EW21, LL_PWE_EWS_EW22, LL_PWE_EWS_EW23, LL_PWE_EWS_EW24, 
  *         LL_PWE_EWS_EW25, LL_PWE_EWS_EW26 and LL_PWE_EWS_EW27
  *         For BlueNRG-LP device is not valid LL_PWR_EWS_INT2
  */
__STATIC_INLINE void LL_PWR_EnableWakeupSource(uint32_t wakeup_sources)
{
  SET_BIT(PWR->CR3, (wakeup_sources & 0x0000FFFF));
  SET_BIT(PWR->CR6, (wakeup_sources >> 16));
}

/**
  * @brief  Disable Wakeup Source to get out of DEEPSTOP mode.
  * @rmtoll CR3/CR6               LL_PWR_DisableWakeupSource
  * @param  wakeup_sources Disable the wakeup sources. This parameter can be a combination of the following values:
  *         @arg @ref LL_PWR_EWS_INT
  *         @arg @ref LL_PWR_EWS_BLEHOST 
  *         @arg @ref LL_PWR_EWS_BLE     
  *         @arg @ref LL_PWE_EWS_EW27
  *         @arg @ref LL_PWE_EWS_EW26
  *         @arg @ref LL_PWE_EWS_EW25
  *         @arg @ref LL_PWE_EWS_EW24
  *         @arg @ref LL_PWE_EWS_EW23
  *         @arg @ref LL_PWE_EWS_EW22
  *         @arg @ref LL_PWE_EWS_EW21
  *         @arg @ref LL_PWE_EWS_EW20
  *         @arg @ref LL_PWE_EWS_EW19
  *         @arg @ref LL_PWE_EWS_EW18
  *         @arg @ref LL_PWE_EWS_EW17
  *         @arg @ref LL_PWE_EWS_EW16
  *         @arg @ref LL_PWE_EWS_EW15
  *         @arg @ref LL_PWE_EWS_EW14
  *         @arg @ref LL_PWE_EWS_EW13
  *         @arg @ref LL_PWE_EWS_EW12
  *         @arg @ref LL_PWE_EWS_EW11    
  *         @arg @ref LL_PWE_EWS_EW10    
  *         @arg @ref LL_PWE_EWS_EW9     
  *         @arg @ref LL_PWE_EWS_EW8     
  *         @arg @ref LL_PWE_EWS_EW7     
  *         @arg @ref LL_PWE_EWS_EW6     
  *         @arg @ref LL_PWE_EWS_EW5     
  *         @arg @ref LL_PWE_EWS_EW4     
  *         @arg @ref LL_PWE_EWS_EW3     
  *         @arg @ref LL_PWE_EWS_EW2     
  *         @arg @ref LL_PWE_EWS_EW1     
  *         @arg @ref LL_PWE_EWS_EW0
  * @retval None
  *         LL_PWE_EWS_EW21, LL_PWE_EWS_EW22, LL_PWE_EWS_EW23, LL_PWE_EWS_EW24, 
  *         LL_PWE_EWS_EW25, LL_PWE_EWS_EW26 and LL_PWE_EWS_EW27
  *         For BlueNRG-LP device is not valid LL_PWR_EWS_INT2
  */
__STATIC_INLINE void LL_PWR_DisableWakeupSource(uint32_t wakeup_sources)
{
  CLEAR_BIT(PWR->CR3, (wakeup_sources & 0x0000FFFF));
  CLEAR_BIT(PWR->CR6, (wakeup_sources >> 16));
}

/**
  * @brief  Is Wakeup Source enabled.
  * @rmtoll CR3/CR6               LL_PWR_IsEnabledWakeupSource
  * @param  wakeup_sources Disable the wakeup sources. This parameter can be a combination of the following values:
  *         @arg @ref LL_PWR_EWS_INT
  *         @arg @ref LL_PWR_EWS_INT2
  *         @arg @ref LL_PWR_EWS_BLEHOST 
  *         @arg @ref LL_PWR_EWS_BLE     
  *         @arg @ref LL_PWE_EWS_EW27
  *         @arg @ref LL_PWE_EWS_EW26
  *         @arg @ref LL_PWE_EWS_EW25
  *         @arg @ref LL_PWE_EWS_EW24
  *         @arg @ref LL_PWE_EWS_EW23
  *         @arg @ref LL_PWE_EWS_EW22
  *         @arg @ref LL_PWE_EWS_EW21
  *         @arg @ref LL_PWE_EWS_EW20
  *         @arg @ref LL_PWE_EWS_EW19
  *         @arg @ref LL_PWE_EWS_EW18
  *         @arg @ref LL_PWE_EWS_EW17
  *         @arg @ref LL_PWE_EWS_EW16
  *         @arg @ref LL_PWE_EWS_EW15
  *         @arg @ref LL_PWE_EWS_EW14
  *         @arg @ref LL_PWE_EWS_EW13
  *         @arg @ref LL_PWE_EWS_EW12
  *         @arg @ref LL_PWE_EWS_EW11    
  *         @arg @ref LL_PWE_EWS_EW10    
  *         @arg @ref LL_PWE_EWS_EW9     
  *         @arg @ref LL_PWE_EWS_EW8     
  *         @arg @ref LL_PWE_EWS_EW7     
  *         @arg @ref LL_PWE_EWS_EW6     
  *         @arg @ref LL_PWE_EWS_EW5     
  *         @arg @ref LL_PWE_EWS_EW4     
  *         @arg @ref LL_PWE_EWS_EW3     
  *         @arg @ref LL_PWE_EWS_EW2     
  *         @arg @ref LL_PWE_EWS_EW1     
  *         @arg @ref LL_PWE_EWS_EW0
  * @retval State of bit (1 or 0).
  *         LL_PWE_EWS_EW21, LL_PWE_EWS_EW22, LL_PWE_EWS_EW23, LL_PWE_EWS_EW24, 
  *         LL_PWE_EWS_EW25, LL_PWE_EWS_EW26 and LL_PWE_EWS_EW27
  *         For BlueNRG-LP device is not valid LL_PWR_EWS_INT2
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledWakeupSource(uint32_t wakeup_sources)
{
  return ((READ_BIT(PWR->CR3, (wakeup_sources & 0x0000FFFF)) == (wakeup_sources & 0x0000FFFF)) &&
          (READ_BIT(PWR->CR6, (wakeup_sources >> 16)) == (wakeup_sources >> 16)) ? 1UL : 0UL);
}

/**
  * @brief  Set the polarity for the I/Os wakeup sources.
  * @rmtoll CR4/CR7               LL_PWR_SetWakeupIOPolarity
  * @param  IO IO to configure. This parameter can be a combination of the following values:
  *         @arg @ref LL_PWE_EWS_EW27
  *         @arg @ref LL_PWE_EWS_EW26
  *         @arg @ref LL_PWE_EWS_EW25
  *         @arg @ref LL_PWE_EWS_EW24
  *         @arg @ref LL_PWE_EWS_EW23
  *         @arg @ref LL_PWE_EWS_EW22
  *         @arg @ref LL_PWE_EWS_EW21
  *         @arg @ref LL_PWE_EWS_EW20
  *         @arg @ref LL_PWE_EWS_EW19
  *         @arg @ref LL_PWE_EWS_EW18
  *         @arg @ref LL_PWE_EWS_EW17
  *         @arg @ref LL_PWE_EWS_EW16
  *         @arg @ref LL_PWE_EWS_EW15
  *         @arg @ref LL_PWE_EWS_EW14
  *         @arg @ref LL_PWE_EWS_EW13
  *         @arg @ref LL_PWE_EWS_EW12
  *         @arg @ref LL_PWE_EWS_EW11
  *         @arg @ref LL_PWE_EWS_EW10
  *         @arg @ref LL_PWE_EWS_EW9
  *         @arg @ref LL_PWE_EWS_EW8
  *         @arg @ref LL_PWE_EWS_EW7
  *         @arg @ref LL_PWE_EWS_EW6
  *         @arg @ref LL_PWE_EWS_EW5
  *         @arg @ref LL_PWE_EWS_EW4
  *         @arg @ref LL_PWE_EWS_EW3
  *         @arg @ref LL_PWE_EWS_EW2
  *         @arg @ref LL_PWE_EWS_EW1
  *         @arg @ref LL_PWE_EWS_EW0
  * @param  polarity IO polarity to configure. This parameter can be one of the following values:
  *         @arg @ref LL_PWR_WUP_RISIEDG 
  *         @arg @ref LL_PWR_WUP_FALLEDG 
  * @retval None
  *         LL_PWE_EWS_EW21, LL_PWE_EWS_EW22, LL_PWE_EWS_EW23, LL_PWE_EWS_EW24, 
  *         LL_PWE_EWS_EW25, LL_PWE_EWS_EW26 and LL_PWE_EWS_EW27
  */
__STATIC_INLINE void LL_PWR_SetWakeupIOPolarity(uint32_t IO, uint32_t polarity)
{
  if (polarity == LL_PWR_WUP_FALLEDG)
  {
    SET_BIT(PWR->CR4, (IO & 0x0000FFFF));
    SET_BIT(PWR->CR7, (IO >> 16));
  } else {
    CLEAR_BIT(PWR->CR4, (IO & 0x0000FFFF));
    CLEAR_BIT(PWR->CR7, (IO >> 16));;
  }
}

/**
  * @brief  Get the polarity for the I/Os wakeup sources.
  * @rmtoll CR4/CR7               LL_PWR_GetWakeupIOPolarity
  * @param  IO IO configured. This parameter can be one of the following values:
  *         @arg @ref LL_PWE_EWS_EW27
  *         @arg @ref LL_PWE_EWS_EW26
  *         @arg @ref LL_PWE_EWS_EW25
  *         @arg @ref LL_PWE_EWS_EW24
  *         @arg @ref LL_PWE_EWS_EW23
  *         @arg @ref LL_PWE_EWS_EW22
  *         @arg @ref LL_PWE_EWS_EW21
  *         @arg @ref LL_PWE_EWS_EW20
  *         @arg @ref LL_PWE_EWS_EW19
  *         @arg @ref LL_PWE_EWS_EW18
  *         @arg @ref LL_PWE_EWS_EW17
  *         @arg @ref LL_PWE_EWS_EW16
  *         @arg @ref LL_PWE_EWS_EW15
  *         @arg @ref LL_PWE_EWS_EW14
  *         @arg @ref LL_PWE_EWS_EW13
  *         @arg @ref LL_PWE_EWS_EW12
  *         @arg @ref LL_PWE_EWS_EW11
  *         @arg @ref LL_PWE_EWS_EW10
  *         @arg @ref LL_PWE_EWS_EW9
  *         @arg @ref LL_PWE_EWS_EW8
  *         @arg @ref LL_PWE_EWS_EW7
  *         @arg @ref LL_PWE_EWS_EW6
  *         @arg @ref LL_PWE_EWS_EW5
  *         @arg @ref LL_PWE_EWS_EW4
  *         @arg @ref LL_PWE_EWS_EW3
  *         @arg @ref LL_PWE_EWS_EW2
  *         @arg @ref LL_PWE_EWS_EW1
  *         @arg @ref LL_PWE_EWS_EW0
  * @retval The IO polarity. This parameter can be one of the following values:
  *         @arg @ref LL_PWR_WUP_RISIEDG 
  *         @arg @ref LL_PWR_WUP_FALLEDG 
  *         LL_PWE_EWS_EW21, LL_PWE_EWS_EW22, LL_PWE_EWS_EW23, LL_PWE_EWS_EW24, 
  *         LL_PWE_EWS_EW25, LL_PWE_EWS_EW26 and LL_PWE_EWS_EW27
  */
__STATIC_INLINE uint32_t LL_PWR_GetWakeupIOPolarity(uint32_t IO)
{
  if (IO & 0x0000FFFF) {
    return (uint32_t)((READ_BIT(PWR->CR4, (IO & 0x0000FFFF))) ? 1UL : 0UL);
  } else {
    return (uint32_t)((READ_BIT(PWR->CR7, (IO >> 16))) ? 1UL : 0UL);
}

