EduardoHM98/LoRaMac-node/src/boards/mcu/stm32/BlueNRG-LP/inc/rf_driver_ll_pwr.h
}

/**
  * @brief  Get which source woken up the device after a DEEPSTOP.
  * @rmtoll SR1/SR3               LL_PWR_GetWakeupSource
  * @retval Wakeup Source from DEEPSTOP. This parameter can be a combination of the following values:
  *         @arg @ref LL_PWR_EWS_INT
  *         @arg @ref LL_PWR_EWS_INT2
  *         @arg @ref LL_PWR_EWS_BLEHOST 
  *         @arg @ref LL_PWR_EWS_BLE     
  *         @arg @ref LL_PWE_EWS_EW27
  *         @arg @ref LL_PWE_EWS_EW26
  *         @arg @ref LL_PWE_EWS_EW25
  *         @arg @ref LL_PWE_EWS_EW24
  *         @arg @ref LL_PWE_EWS_EW23
  *         @arg @ref LL_PWE_EWS_EW22
  *         @arg @ref LL_PWE_EWS_EW21
  *         @arg @ref LL_PWE_EWS_EW20
  *         @arg @ref LL_PWE_EWS_EW19
  *         @arg @ref LL_PWE_EWS_EW18
  *         @arg @ref LL_PWE_EWS_EW17
  *         @arg @ref LL_PWE_EWS_EW16
  *         @arg @ref LL_PWE_EWS_EW15
  *         @arg @ref LL_PWE_EWS_EW14
  *         @arg @ref LL_PWE_EWS_EW13
  *         @arg @ref LL_PWE_EWS_EW12
  *         @arg @ref LL_PWE_EWS_EW11    
  *         @arg @ref LL_PWE_EWS_EW10    
  *         @arg @ref LL_PWE_EWS_EW9     
  *         @arg @ref LL_PWE_EWS_EW8     
  *         @arg @ref LL_PWE_EWS_EW7     
  *         @arg @ref LL_PWE_EWS_EW6     
  *         @arg @ref LL_PWE_EWS_EW5     
  *         @arg @ref LL_PWE_EWS_EW4     
  *         @arg @ref LL_PWE_EWS_EW3     
  *         @arg @ref LL_PWE_EWS_EW2     
  *         @arg @ref LL_PWE_EWS_EW1     
  *         @arg @ref LL_PWE_EWS_EW0
  *         LL_PWE_EWS_EW21, LL_PWE_EWS_EW22, LL_PWE_EWS_EW23, LL_PWE_EWS_EW24, 
  *         LL_PWE_EWS_EW25, LL_PWE_EWS_EW26 and LL_PWE_EWS_EW27
  *         For BlueNRG-LP device is not valid LL_PWR_EWS_INT2
  */
__STATIC_INLINE uint32_t LL_PWR_GetWakeupSource(void)
{
  uint32_t wakeup_source;
  
  wakeup_source = READ_REG(PWR->SR1) & 0x0000FFFF;
  return (uint32_t)(wakeup_source | (READ_REG(PWR->SR3) << 16));
}

/**
  * @brief  Clear the source that woken up the device after a DEEPSTOP.
  * @rmtoll SR1 /SR3              LL_PWR_ClearWakeupSource
  * @param  source Wakeup Source from DEEPSTOP. This parameter can be a combination of the following values:
  *         @arg @ref LL_PWE_EWS_ALL
  *         @arg @ref LL_PWR_EWS_INT
  *         @arg @ref LL_PWR_EWS_INT2
  *         @arg @ref LL_PWR_EWS_BLEHOST 
  *         @arg @ref LL_PWR_EWS_BLE     
  *         @arg @ref LL_PWE_EWS_EW27
  *         @arg @ref LL_PWE_EWS_EW26
  *         @arg @ref LL_PWE_EWS_EW25
  *         @arg @ref LL_PWE_EWS_EW24
  *         @arg @ref LL_PWE_EWS_EW23
  *         @arg @ref LL_PWE_EWS_EW22
  *         @arg @ref LL_PWE_EWS_EW21
  *         @arg @ref LL_PWE_EWS_EW20
  *         @arg @ref LL_PWE_EWS_EW19
  *         @arg @ref LL_PWE_EWS_EW18
  *         @arg @ref LL_PWE_EWS_EW17
  *         @arg @ref LL_PWE_EWS_EW16
  *         @arg @ref LL_PWE_EWS_EW15
  *         @arg @ref LL_PWE_EWS_EW14
  *         @arg @ref LL_PWE_EWS_EW13
  *         @arg @ref LL_PWE_EWS_EW12     
  *         @arg @ref LL_PWE_EWS_EW11    
  *         @arg @ref LL_PWE_EWS_EW10    
  *         @arg @ref LL_PWE_EWS_EW9     
  *         @arg @ref LL_PWE_EWS_EW8     
  *         @arg @ref LL_PWE_EWS_EW7     
  *         @arg @ref LL_PWE_EWS_EW6     
  *         @arg @ref LL_PWE_EWS_EW5     
  *         @arg @ref LL_PWE_EWS_EW4     
  *         @arg @ref LL_PWE_EWS_EW3     
  *         @arg @ref LL_PWE_EWS_EW2     
  *         @arg @ref LL_PWE_EWS_EW1     
  *         @arg @ref LL_PWE_EWS_EW0
  *         @arg @ref LL_PWE_EWS_ALL
  * @retval None
  *         LL_PWE_EWS_EW21, LL_PWE_EWS_EW22, LL_PWE_EWS_EW23, LL_PWE_EWS_EW24, 
  *         LL_PWE_EWS_EW25, LL_PWE_EWS_EW26 and LL_PWE_EWS_EW27
  *         For BlueNRG-LP device is not valid LL_PWR_EWS_INT2
  */
__STATIC_INLINE void LL_PWR_ClearWakeupSource(uint32_t source)
{
  WRITE_REG(PWR->SR1, (source & 0x0000FFFF));
  WRITE_REG(PWR->SR3, (source >> 16));
}

  
/**
  * @brief  Get IO BOOT value.
  * @rmtoll SR2               LL_PWR_GetIOBootVal
  * @param  IO. This parameter can be one of the following values:
  *         @arg @ref LL_PWR_PA8_LATCH_POR
  *         @arg @ref LL_PWR_PA9_LATCH_POR
  *         @arg @ref LL_PWR_PA10_LATCH_POR
  *         @arg @ref LL_PWR_PA11_LATCH_POR
  *         @arg @ref LL_PWR_PB12_LATCH_POR
  *         @arg @ref LL_PWR_PB13_LATCH_POR
  *         @arg @ref LL_PWR_PB14_LATCH_POR
  *         @arg @ref LL_PWR_PB15_LATCH_POR
  * @retval State of pin (1 or 0).
  * @note   For BlueNRG-LP device are not valid LL_PWR_PB12_LATCH_POR,
  *         LL_PWR_PB13_LATCH_POR, LL_PWR_PB14_LATCH_POR, LL_PWR_PB15_LATCH_POR 
  */
__STATIC_INLINE uint32_t LL_PWR_GetIOBootVal(uint32_t IO)
{
  return ((READ_BIT(PWR->SR2, IO) == (IO)) ? 1UL : 0UL);
}

/**
  * @brief  Get the Power voltage Detector Output.
  *         When the Power voltage Detector is enabled (PWRC_CR2.PVDE=1), this bit indicates when
  *         the VDDIO is lower than the selected threshold (through PWRC_CR2.PVDLS bit field).
  * @rmtoll SR2       PWR_SR2_PVDO         LL_PWR_GetPVDO
  * @retval State of bit (1 or 0). 1=The VDDIO is lower than the selected threshold
  */
__STATIC_INLINE uint32_t LL_PWR_GetPVDO(void)
{
  return ((READ_BIT(PWR->SR2, PWR_SR2_PVDO) == (PWR_SR2_PVDO)) ? 1UL : 0UL);
}

#if defined(PWR_SR2_REGMS)
/**
  * @brief  Get the Main Regulator ready status.
  * @rmtoll SR2      PWR_SR2_REGMS         LL_PWR_IsMainRegulatorReady
  * @retval State of Main Regulator (1=ready or 0=not ready).
  */
__STATIC_INLINE uint32_t LL_PWR_IsMainRegulatorReady(void)
{
  return ((READ_BIT(PWR->SR2, PWR_SR2_REGMS) == (PWR_SR2_REGMS)) ? 1UL : 0UL);
}
#endif

/**
  * @brief  Get the Low Power Regulator ready status.
  * @rmtoll SR2      PWR_SR2_REGLPS         LL_PWR_IsLowPowerRegulatorReady
  * @retval State of Low Power Regulator (1=ready or 0=not ready).
  */
__STATIC_INLINE uint32_t LL_PWR_IsLowPowerRegulatorReady(void)
{
  return ((READ_BIT(PWR->SR2, PWR_SR2_REGLPS) == (PWR_SR2_REGLPS)) ? 1UL : 0UL);
}

/**
  * @brief  Get the SMPS ready status.
  * @rmtoll SR2    PWR_SR2_SMPSRDY      LL_PWR_IsSMPSReady
  * @retval State of SMPS (1=ready or 0=not ready).
  */
__STATIC_INLINE uint32_t LL_PWR_IsSMPSReady(void)
{
  return ((READ_BIT(PWR->SR2, PWR_SR2_SMPSRDY) == (PWR_SR2_SMPSRDY)) ? 1UL : 0UL);
}

/**
  * @brief  Get the SMPS RUN mode status.
  * @rmtoll SR2       PWR_SR2_SMPSENR         LL_PWR_IsSMPSinRUNMode
  * @retval SMPS RUN mode status (1=SMPS in RUN mode or 0=in PRECHARGE or NOSMPS mode).
  */
__STATIC_INLINE uint32_t LL_PWR_IsSMPSinRUNMode(void)
{
  return ((READ_BIT(PWR->SR2, PWR_SR2_SMPSENR) == (PWR_SR2_SMPSENR)) ? 1UL : 0UL);
}

/**
  * @brief  Get the SMPS PRECHARGE mode status.
  * @rmtoll SR2    PWR_SR2_SMPSBYPR     LL_PWR_IsSMPSinPRECHARGEMode
  * @retval SMPS PRECHARGE mode status (1=SMPS regulator is in PRECHARGE mode or 0=NOT in PRECHARGE).
  */
__STATIC_INLINE uint32_t LL_PWR_IsSMPSinPRECHARGEMode(void)
{
  return ((READ_BIT(PWR->SR2, PWR_SR2_SMPSBYPR) == (PWR_SR2_SMPSBYPR)) ? 1UL : 0UL);
}

/**
  * @brief  Set SMPS Mode.
  * @rmtoll CR5          PWR_CR5_NOSMPS           LL_PWR_SetSMPSMode
  * @param mode SMPS Mode. This parameter can be one of the following values:
  *         @arg @ref LL_PWR_SMPS
  *         @arg @ref LL_PWR_NO_SMPS
  * @retval None
  */
__STATIC_INLINE void LL_PWR_SetSMPSMode(uint32_t mode)
{
  MODIFY_REG(PWR->CR5, PWR_CR5_NOSMPS, mode);
}

/**
  * @brief  Get SMPS Mode.
  * @rmtoll CR5          PWR_CR5_NOSMPS           LL_PWR_GetSMPSMode
  * @retval SMPS Mode. This parameter can be one of the following values:
  *         @arg @ref LL_PWR_SMPS
  *         @arg @ref LL_PWR_NO_SMPS
  */
  __STATIC_INLINE uint32_t LL_PWR_GetSMPSMode(void)
{
  return (uint32_t) (READ_BIT(PWR->CR5, PWR_CR5_NOSMPS));
}

/**
  * @brief  Set SMPS in PRECHARGE Mode.
  * @rmtoll CR5          PWR_CR5_SMPSFBYP           LL_PWR_SetSMPSPrechargeMode
  * @param mode SMPS in Precharge Mode. This parameter can be one of the following values:
  *         @arg @ref LL_PWR_NO_SMPS_PRECHARGE
  *         @arg @ref LL_PWR_SMPS_PRECHARGE
  * @retval None
  */
__STATIC_INLINE void  LL_PWR_SetSMPSPrechargeMode(uint32_t mode)
{
  MODIFY_REG(PWR->CR5, PWR_CR5_SMPSFBYP, mode);
}

/**
  * @brief  Set SMPS OPEN Mode during DEEPSTOP.
  * @rmtoll CR5          PWR_CR5_NOSMPS           LL_PWR_SetSMPSOpenMode
  * @param  mode SMPS Mode. This parameter can be one of the following values:
  *         @arg @ref LL_PWR_NO_SMPS_LPOPEN
  *         @arg @ref LL_PWR_SMPS_LPOPEN
  */
__STATIC_INLINE void LL_PWR_SetSMPSOpenMode(uint32_t mode)
{
  MODIFY_REG(PWR->CR5, PWR_CR5_SMPSLPOPEN, mode);
}

/**
  * @brief  Set SMPS BOM
  * @rmtoll CR5   PWR_CR5_SMPSBOMSEL_0/PWR_CR5_SMPSBOMSEL_1    LL_PWR_SetSMPSBOM
  * @param  BOM BOM. This parameter can be one of the following values:
  *         @arg @ref LL_PWR_SMPS_BOM1
  *         @arg @ref LL_PWR_SMPS_BOM2
  *         @arg @ref LL_PWR_SMPS_BOM3
  */
__STATIC_INLINE void LL_PWR_SetSMPSBOM(uint32_t BOM)
{
  MODIFY_REG(PWR->CR5, PWR_CR5_SMPSBOMSEL, BOM);
}

/**
  * @brief  Get SMPS BOM
  * @rmtoll CR5   PWR_CR5_SMPSBOMSEL_0/PWR_CR5_SMPSBOMSEL_1    LL_PWR_GetSMPSBOM
  * @retval BOM. This parameter can be one of the following values:
  *         @arg @ref LL_PWR_SMPS_BOM1
  *         @arg @ref LL_PWR_SMPS_BOM2
  *         @arg @ref LL_PWR_SMPS_BOM3
  */
__STATIC_INLINE uint32_t LL_PWR_GetSMPSBOM(void)
{
  return (uint32_t) (READ_BIT(PWR->CR5, PWR_CR5_SMPSBOMSEL));
}

/**
  * @brief  Set SMPS Output Level
  * @rmtoll CR5   PWR_CR5_SMPSLVL    LL_PWR_SetSMPSOutputLevel
  * @param  output_level Output Level. This parameter can be one of the following values:
  *         @arg @ref LL_PWR_SMPS_OUTLVL_1V2
  *         @arg @ref LL_PWR_SMPS_OUTLVL_1V25             
  *         @arg @ref LL_PWR_SMPS_OUTLVL_1V3              
  *         @arg @ref LL_PWR_SMPS_OUTLVL_1V35             
  *         @arg @ref LL_PWR_SMPS_OUTLVL_1V4              
  *         @arg @ref LL_PWR_SMPS_OUTLVL_1V45              
  *         @arg @ref LL_PWR_SMPS_OUTLVL_1V5               
  *         @arg @ref LL_PWR_SMPS_OUTLVL_1V55              
  *         @arg @ref LL_PWR_SMPS_OUTLVL_1V6               
  *         @arg @ref LL_PWR_SMPS_OUTLVL_1V65              
  *         @arg @ref LL_PWR_SMPS_OUTLVL_1V7               
  *         @arg @ref LL_PWR_SMPS_OUTLVL_1V75              
  *         @arg @ref LL_PWR_SMPS_OUTLVL_1V8               
  *         @arg @ref LL_PWR_SMPS_OUTLVL_1V85              
  *         @arg @ref LL_PWR_SMPS_OUTLVL_1V9               
  *         @arg @ref LL_PWR_SMPS_OUTLVL_1V95
  * @retval None
  */
__STATIC_INLINE void LL_PWR_SetSMPSOutputLevel(uint32_t output_level)
{
  MODIFY_REG(PWR->CR5, PWR_CR5_SMPSLVL, output_level);
}

/**
  * @brief  Get SMPS Output Level
  * @rmtoll CR5   PWR_CR5_SMPSLVL    LL_PWR_GetSMPSOutputLevel
  * @retval Output Level. This parameter can be one of the following values:
  *         @arg @ref LL_PWR_SMPS_OUTLVL_1V2
  *         @arg @ref LL_PWR_SMPS_OUTLVL_1V25             
  *         @arg @ref LL_PWR_SMPS_OUTLVL_1V3              
  *         @arg @ref LL_PWR_SMPS_OUTLVL_1V35             
  *         @arg @ref LL_PWR_SMPS_OUTLVL_1V4              
  *         @arg @ref LL_PWR_SMPS_OUTLVL_1V45              
  *         @arg @ref LL_PWR_SMPS_OUTLVL_1V5               
  *         @arg @ref LL_PWR_SMPS_OUTLVL_1V55              
  *         @arg @ref LL_PWR_SMPS_OUTLVL_1V6               
  *         @arg @ref LL_PWR_SMPS_OUTLVL_1V65              
  *         @arg @ref LL_PWR_SMPS_OUTLVL_1V7               
  *         @arg @ref LL_PWR_SMPS_OUTLVL_1V75              
  *         @arg @ref LL_PWR_SMPS_OUTLVL_1V8               
  *         @arg @ref LL_PWR_SMPS_OUTLVL_1V85              
  *         @arg @ref LL_PWR_SMPS_OUTLVL_1V9               
  *         @arg @ref LL_PWR_SMPS_OUTLVL_1V95
  */
__STATIC_INLINE uint32_t LL_PWR_GetSMPSOutputLevel(void)
{
  return (uint32_t)(READ_BIT(PWR->CR5, PWR_CR5_SMPSLVL));
}

/**
  * @brief  Enable pull-up and pull-down configuration
  * @rmtoll CR1          APC           LL_PWR_EnablePUPDCfg
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnablePUPDCfg(void)
{
  SET_BIT(PWR->CR1, PWR_CR1_APC);
}

/**
  * @brief  Disable pull-up and pull-down configuration
  * @rmtoll CR1          APC           LL_PWR_DisablePUPDCfg
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisablePUPDCfg(void)
{
  CLEAR_BIT(PWR->CR1, PWR_CR1_APC);
}

/**
  * @brief  Check if pull-up and pull-down configuration is enabled
  * @rmtoll CR1          APC           LL_PWR_IsEnabledPUPDCfg
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledPUPDCfg(void)
{
  return ((READ_BIT(PWR->CR1, PWR_CR1_APC) == (PWR_CR1_APC)) ? 1UL : 0UL);
}

/**
  * @brief  Enable the IO pull-up configuration for port A.
  * @rmtoll PUCRA               LL_PWR_EnablePUA
  * @param  IO Pins Pull-up enable. This parameter can be a combination of the following values:
  *         @arg @ref LL_PWR_PUPD_IO0
  *         @arg @ref LL_PWR_PUPD_IO1
  *         @arg @ref LL_PWR_PUPD_IO2
  *         @arg @ref LL_PWR_PUPD_IO3
  *         @arg @ref LL_PWR_PUPD_IO4
  *         @arg @ref LL_PWR_PUPD_IO5
  *         @arg @ref LL_PWR_PUPD_IO6
  *         @arg @ref LL_PWR_PUPD_IO7
  *         @arg @ref LL_PWR_PUPD_IO8
  *         @arg @ref LL_PWR_PUPD_IO9
  *         @arg @ref LL_PWR_PUPD_IO10
  *         @arg @ref LL_PWR_PUPD_IO11
  *         @arg @ref LL_PWR_PUPD_IO12
  *         @arg @ref LL_PWR_PUPD_IO13
  *         @arg @ref LL_PWR_PUPD_IO14
  *         @arg @ref LL_PWR_PUPD_IO15
  * @retval None
  *         LL_PWR_PUPD_IO6, LL_PWR_PUPD_IO7, LL_PWR_PUPD_IO12, LL_PWR_PUPD_IO13,
  *         LL_PWR_PUPD_IO14, LL_PWR_PUPD_IO15
  */
__STATIC_INLINE void LL_PWR_EnablePUA(uint32_t IO)
{
  CLEAR_BIT(PWR->PDCRA, IO); 
  SET_BIT(PWR->PUCRA, IO);
}

/**
  * @brief  Disable the IO pull-up configuration for port A.
  * @rmtoll PUCRA               LL_PWR_DisablePUA
  * @param  IO Pins Pull-up disable. This parameter can be a combination of the following values:
  *         @arg @ref LL_PWR_PUPD_IO0
  *         @arg @ref LL_PWR_PUPD_IO1
  *         @arg @ref LL_PWR_PUPD_IO2
  *         @arg @ref LL_PWR_PUPD_IO3
  *         @arg @ref LL_PWR_PUPD_IO4
  *         @arg @ref LL_PWR_PUPD_IO5
  *         @arg @ref LL_PWR_PUPD_IO6
  *         @arg @ref LL_PWR_PUPD_IO7
  *         @arg @ref LL_PWR_PUPD_IO8
  *         @arg @ref LL_PWR_PUPD_IO9
  *         @arg @ref LL_PWR_PUPD_IO10
  *         @arg @ref LL_PWR_PUPD_IO11
  *         @arg @ref LL_PWR_PUPD_IO12
  *         @arg @ref LL_PWR_PUPD_IO13
  *         @arg @ref LL_PWR_PUPD_IO14
  *         @arg @ref LL_PWR_PUPD_IO15
  * @retval None
  *         LL_PWR_PUPD_IO6, LL_PWR_PUPD_IO7, LL_PWR_PUPD_IO12, LL_PWR_PUPD_IO13,
  *         LL_PWR_PUPD_IO14, LL_PWR_PUPD_IO15
  */
__STATIC_INLINE void LL_PWR_DisablePUA(uint32_t IO)
{
  CLEAR_BIT(PWR->PUCRA, IO); 
}

/**
  * @brief  Checks if IO pull-up is enabled or disabled for port A.
  * @rmtoll PUCRA               LL_PWR_IsEnabledPUA
  * @param  IO Pins Pull-up disable. This parameter can be a combination of the following values:
  *         @arg @ref LL_PWR_PUPD_IO0
  *         @arg @ref LL_PWR_PUPD_IO1
  *         @arg @ref LL_PWR_PUPD_IO2
  *         @arg @ref LL_PWR_PUPD_IO3
  *         @arg @ref LL_PWR_PUPD_IO4
  *         @arg @ref LL_PWR_PUPD_IO5
  *         @arg @ref LL_PWR_PUPD_IO6
  *         @arg @ref LL_PWR_PUPD_IO7
  *         @arg @ref LL_PWR_PUPD_IO8
  *         @arg @ref LL_PWR_PUPD_IO9
  *         @arg @ref LL_PWR_PUPD_IO10
  *         @arg @ref LL_PWR_PUPD_IO11
  *         @arg @ref LL_PWR_PUPD_IO12
  *         @arg @ref LL_PWR_PUPD_IO13
  *         @arg @ref LL_PWR_PUPD_IO14
  *         @arg @ref LL_PWR_PUPD_IO15
  * @retval State of bit (1 or 0).
  *         LL_PWR_PUPD_IO6, LL_PWR_PUPD_IO7, LL_PWR_PUPD_IO12, LL_PWR_PUPD_IO13,
  *         LL_PWR_PUPD_IO14, LL_PWR_PUPD_IO15
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledPUA(uint32_t IO)
{
  return ((READ_BIT(PWR->PUCRA, IO) == (IO)) ? 1UL : 0UL);
}

/**
  * @brief  Enable the IO pull-down configuration for port A.
  * @rmtoll PDCRA               LL_PWR_EnablePDA
  * @param  IO Pins Pull-down enable. This parameter can be a combination of the following values:
  *         @arg @ref LL_PWR_PUPD_IO0
  *         @arg @ref LL_PWR_PUPD_IO1
  *         @arg @ref LL_PWR_PUPD_IO2
  *         @arg @ref LL_PWR_PUPD_IO3
  *         @arg @ref LL_PWR_PUPD_IO4
  *         @arg @ref LL_PWR_PUPD_IO5
  *         @arg @ref LL_PWR_PUPD_IO6
  *         @arg @ref LL_PWR_PUPD_IO7
  *         @arg @ref LL_PWR_PUPD_IO8
  *         @arg @ref LL_PWR_PUPD_IO9
  *         @arg @ref LL_PWR_PUPD_IO10
  *         @arg @ref LL_PWR_PUPD_IO11
  *         @arg @ref LL_PWR_PUPD_IO12
  *         @arg @ref LL_PWR_PUPD_IO13
  *         @arg @ref LL_PWR_PUPD_IO14
  *         @arg @ref LL_PWR_PUPD_IO15
  * @retval None
  *         LL_PWR_PUPD_IO6, LL_PWR_PUPD_IO7, LL_PWR_PUPD_IO12, LL_PWR_PUPD_IO13,
  *         LL_PWR_PUPD_IO14, LL_PWR_PUPD_IO15
  */
__STATIC_INLINE void LL_PWR_EnablePDA(uint32_t IO)
{
  CLEAR_BIT(PWR->PUCRA, IO); 
  SET_BIT(PWR->PDCRA, IO);
}

/**
  * @brief  Disable the IO pull-down configuration for port A.
  * @rmtoll PDCRA               LL_PWR_DisablePDA
  * @param  IO Pins Pull-down disable. This parameter can be a combination of the following values:
  *         @arg @ref LL_PWR_PUPD_IO0
  *         @arg @ref LL_PWR_PUPD_IO1
  *         @arg @ref LL_PWR_PUPD_IO2
  *         @arg @ref LL_PWR_PUPD_IO3
  *         @arg @ref LL_PWR_PUPD_IO4
  *         @arg @ref LL_PWR_PUPD_IO5
  *         @arg @ref LL_PWR_PUPD_IO6
  *         @arg @ref LL_PWR_PUPD_IO7
  *         @arg @ref LL_PWR_PUPD_IO8
  *         @arg @ref LL_PWR_PUPD_IO9
  *         @arg @ref LL_PWR_PUPD_IO10
  *         @arg @ref LL_PWR_PUPD_IO11
  *         @arg @ref LL_PWR_PUPD_IO12
  *         @arg @ref LL_PWR_PUPD_IO13
  *         @arg @ref LL_PWR_PUPD_IO14
  *         @arg @ref LL_PWR_PUPD_IO15
  * @retval None
  *         LL_PWR_PUPD_IO6, LL_PWR_PUPD_IO7, LL_PWR_PUPD_IO12, LL_PWR_PUPD_IO13,
  *         LL_PWR_PUPD_IO14, LL_PWR_PUPD_IO15
  */
__STATIC_INLINE void LL_PWR_DisablePDA(uint32_t IO)
{
  CLEAR_BIT(PWR->PDCRA, IO); 
}

/**
  * @brief  Checks if IO pull-down is enabled or disabled for port A.
  * @rmtoll PDCRA               LL_PWR_IsEnabledPDA
  * @param  IO Pins Pull-down disable. This parameter can be a combination of the following values:
  *         @arg @ref LL_PWR_PUPD_IO0
  *         @arg @ref LL_PWR_PUPD_IO1
  *         @arg @ref LL_PWR_PUPD_IO2
  *         @arg @ref LL_PWR_PUPD_IO3
  *         @arg @ref LL_PWR_PUPD_IO4
  *         @arg @ref LL_PWR_PUPD_IO5
  *         @arg @ref LL_PWR_PUPD_IO6
  *         @arg @ref LL_PWR_PUPD_IO7
  *         @arg @ref LL_PWR_PUPD_IO8
  *         @arg @ref LL_PWR_PUPD_IO9
  *         @arg @ref LL_PWR_PUPD_IO10
  *         @arg @ref LL_PWR_PUPD_IO11
  *         @arg @ref LL_PWR_PUPD_IO12
  *         @arg @ref LL_PWR_PUPD_IO13
  *         @arg @ref LL_PWR_PUPD_IO14
  *         @arg @ref LL_PWR_PUPD_IO15
  * @retval State of bit (1 or 0).
  *         LL_PWR_PUPD_IO6, LL_PWR_PUPD_IO7, LL_PWR_PUPD_IO12, LL_PWR_PUPD_IO13,
  *         LL_PWR_PUPD_IO14, LL_PWR_PUPD_IO15
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledPDA(uint32_t IO)
{
  return ((READ_BIT(PWR->PDCRA, IO) == (IO)) ? 1UL : 0UL);
}

/**
  * @brief  Configure the IO in NO PULL configuration for port A.
  * @rmtoll PDCRA/PUCRA               LL_PWR_SetNoPullA
  * @param  GPIOx GPIO Port
  * @param  IO Pins No Pull cofiguration. This parameter can be a combination of the following values:
  *         @arg @ref LL_PWR_PUPD_IO0
  *         @arg @ref LL_PWR_PUPD_IO1
  *         @arg @ref LL_PWR_PUPD_IO2
  *         @arg @ref LL_PWR_PUPD_IO3
  *         @arg @ref LL_PWR_PUPD_IO4
  *         @arg @ref LL_PWR_PUPD_IO5
  *         @arg @ref LL_PWR_PUPD_IO6
  *         @arg @ref LL_PWR_PUPD_IO7
  *         @arg @ref LL_PWR_PUPD_IO8
  *         @arg @ref LL_PWR_PUPD_IO9
  *         @arg @ref LL_PWR_PUPD_IO10
  *         @arg @ref LL_PWR_PUPD_IO11
  *         @arg @ref LL_PWR_PUPD_IO12
  *         @arg @ref LL_PWR_PUPD_IO13
  *         @arg @ref LL_PWR_PUPD_IO14
  *         @arg @ref LL_PWR_PUPD_IO15
  * @retval None
  *         LL_PWR_PUPD_IO6, LL_PWR_PUPD_IO7, LL_PWR_PUPD_IO12, LL_PWR_PUPD_IO13,
  *         LL_PWR_PUPD_IO14, LL_PWR_PUPD_IO15
  */
__STATIC_INLINE void LL_PWR_SetNoPullA(uint32_t IO)
{
  CLEAR_BIT(PWR->PUCRA, IO);
  CLEAR_BIT(PWR->PDCRA, IO);
}

/**
  * @brief  Enable the IO pull-up configuration for port B.
  * @rmtoll PUCRB               LL_PWR_EnablePUB
  * @param  IO Pins Pull-up enable. This parameter can be a combination of the following values:
  *         @arg @ref LL_PWR_PUPD_IO0
  *         @arg @ref LL_PWR_PUPD_IO1
  *         @arg @ref LL_PWR_PUPD_IO2
  *         @arg @ref LL_PWR_PUPD_IO3
  *         @arg @ref LL_PWR_PUPD_IO4
  *         @arg @ref LL_PWR_PUPD_IO5
  *         @arg @ref LL_PWR_PUPD_IO6
  *         @arg @ref LL_PWR_PUPD_IO7
  *         @arg @ref LL_PWR_PUPD_IO8
  *         @arg @ref LL_PWR_PUPD_IO9
  *         @arg @ref LL_PWR_PUPD_IO10
  *         @arg @ref LL_PWR_PUPD_IO11
  *         @arg @ref LL_PWR_PUPD_IO12
  *         @arg @ref LL_PWR_PUPD_IO13
  *         @arg @ref LL_PWR_PUPD_IO14
  *         @arg @ref LL_PWR_PUPD_IO15
  * @retval None
  *         LL_PWR_PUPD_IO9, LL_PWR_PUPD_IO10, LL_PWR_PUPD_IO11
  */
__STATIC_INLINE void LL_PWR_EnablePUB(uint32_t IO)
{
  CLEAR_BIT(PWR->PDCRB, IO); 
  SET_BIT(PWR->PUCRB, IO);
}

/**
  * @brief  Disable the IO pull-up configuration for port B.
  * @rmtoll PUCRB               LL_PWR_DisablePUB
  * @param  IO Pins Pull-up disable. This parameter can be a combination of the following values:
  *         @arg @ref LL_PWR_PUPD_IO0
  *         @arg @ref LL_PWR_PUPD_IO1
  *         @arg @ref LL_PWR_PUPD_IO2
  *         @arg @ref LL_PWR_PUPD_IO3
  *         @arg @ref LL_PWR_PUPD_IO4
  *         @arg @ref LL_PWR_PUPD_IO5
  *         @arg @ref LL_PWR_PUPD_IO6
  *         @arg @ref LL_PWR_PUPD_IO7
  *         @arg @ref LL_PWR_PUPD_IO8
  *         @arg @ref LL_PWR_PUPD_IO9
  *         @arg @ref LL_PWR_PUPD_IO10
  *         @arg @ref LL_PWR_PUPD_IO11
  *         @arg @ref LL_PWR_PUPD_IO12
  *         @arg @ref LL_PWR_PUPD_IO13
  *         @arg @ref LL_PWR_PUPD_IO14
  *         @arg @ref LL_PWR_PUPD_IO15
  * @retval None
  *         LL_PWR_PUPD_IO9, LL_PWR_PUPD_IO10, LL_PWR_PUPD_IO11
  */
__STATIC_INLINE void LL_PWR_DisablePUB(uint32_t IO)
{
  CLEAR_BIT(PWR->PUCRB, IO); 
}

/**
  * @brief  Checks if IO pull-up is enabled or disabled for port B.
  * @rmtoll PUCRB               LL_PWR_IsEnabledPUB
  * @param  IO Pins Pull-up disable. This parameter can be a combination of the following values:
  *         @arg @ref LL_PWR_PUPD_IO0
  *         @arg @ref LL_PWR_PUPD_IO1
  *         @arg @ref LL_PWR_PUPD_IO2
  *         @arg @ref LL_PWR_PUPD_IO3
  *         @arg @ref LL_PWR_PUPD_IO4
  *         @arg @ref LL_PWR_PUPD_IO5
  *         @arg @ref LL_PWR_PUPD_IO6
  *         @arg @ref LL_PWR_PUPD_IO7
  *         @arg @ref LL_PWR_PUPD_IO8
  *         @arg @ref LL_PWR_PUPD_IO9
  *         @arg @ref LL_PWR_PUPD_IO10
  *         @arg @ref LL_PWR_PUPD_IO11
  *         @arg @ref LL_PWR_PUPD_IO12
  *         @arg @ref LL_PWR_PUPD_IO13
  *         @arg @ref LL_PWR_PUPD_IO14
  *         @arg @ref LL_PWR_PUPD_IO15
  * @retval State of bit (1 or 0).
  *         LL_PWR_PUPD_IO9, LL_PWR_PUPD_IO10, LL_PWR_PUPD_IO11
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledPUB(uint32_t IO)
{
  return ((READ_BIT(PWR->PUCRB, IO) == (IO)) ? 1UL : 0UL);
}

