EduardoHM98/LoRaMac-node/src/boards/mcu/stm32/BlueNRG-LP/inc/rf_driver_ll_pwr.h
/**
  * @brief  Enable the IO pull-down configuration for port B.
  * @rmtoll PDCRB               LL_PWR_EnablePDB
  * @param  IO Pins Pull-down enable. This parameter can be a combination of the following values:
  *         @arg @ref LL_PWR_PUPD_IO0
  *         @arg @ref LL_PWR_PUPD_IO1
  *         @arg @ref LL_PWR_PUPD_IO2
  *         @arg @ref LL_PWR_PUPD_IO3
  *         @arg @ref LL_PWR_PUPD_IO4
  *         @arg @ref LL_PWR_PUPD_IO5
  *         @arg @ref LL_PWR_PUPD_IO6
  *         @arg @ref LL_PWR_PUPD_IO7
  *         @arg @ref LL_PWR_PUPD_IO8
  *         @arg @ref LL_PWR_PUPD_IO9
  *         @arg @ref LL_PWR_PUPD_IO10
  *         @arg @ref LL_PWR_PUPD_IO11
  *         @arg @ref LL_PWR_PUPD_IO12
  *         @arg @ref LL_PWR_PUPD_IO13
  *         @arg @ref LL_PWR_PUPD_IO14
  *         @arg @ref LL_PWR_PUPD_IO15
  * @retval None
  *         LL_PWR_PUPD_IO9, LL_PWR_PUPD_IO10, LL_PWR_PUPD_IO11
  */
__STATIC_INLINE void LL_PWR_EnablePDB(uint32_t IO)
{
  CLEAR_BIT(PWR->PUCRB, IO); 
  SET_BIT(PWR->PDCRB, IO);
}

/**
  * @brief  Disable the IO pull-down configuration for port B.
  * @rmtoll PDCRB               LL_PWR_DisablePDB
  * @param  IO Pins Pull-down disable. This parameter can be a combination of the following values:
  *         @arg @ref LL_PWR_PUPD_IO0
  *         @arg @ref LL_PWR_PUPD_IO1
  *         @arg @ref LL_PWR_PUPD_IO2
  *         @arg @ref LL_PWR_PUPD_IO3
  *         @arg @ref LL_PWR_PUPD_IO4
  *         @arg @ref LL_PWR_PUPD_IO5
  *         @arg @ref LL_PWR_PUPD_IO6
  *         @arg @ref LL_PWR_PUPD_IO7
  *         @arg @ref LL_PWR_PUPD_IO8
  *         @arg @ref LL_PWR_PUPD_IO9
  *         @arg @ref LL_PWR_PUPD_IO10
  *         @arg @ref LL_PWR_PUPD_IO11
  *         @arg @ref LL_PWR_PUPD_IO12
  *         @arg @ref LL_PWR_PUPD_IO13
  *         @arg @ref LL_PWR_PUPD_IO14
  *         @arg @ref LL_PWR_PUPD_IO15
  * @retval None
  *         LL_PWR_PUPD_IO9, LL_PWR_PUPD_IO10, LL_PWR_PUPD_IO11
  */
__STATIC_INLINE void LL_PWR_DisablePDB(uint32_t IO)
{
  CLEAR_BIT(PWR->PDCRB, IO); 
}

/**
  * @brief  Checks if IO pull-down is enabled or disabled for port B.
  * @rmtoll PDCRB               LL_PWR_IsEnabledPDB
  * @param  IO Pins Pull-down disable. This parameter can be a combination of the following values:
  *         @arg @ref LL_PWR_PUPD_IO0
  *         @arg @ref LL_PWR_PUPD_IO1
  *         @arg @ref LL_PWR_PUPD_IO2
  *         @arg @ref LL_PWR_PUPD_IO3
  *         @arg @ref LL_PWR_PUPD_IO4
  *         @arg @ref LL_PWR_PUPD_IO5
  *         @arg @ref LL_PWR_PUPD_IO6
  *         @arg @ref LL_PWR_PUPD_IO7
  *         @arg @ref LL_PWR_PUPD_IO8
  *         @arg @ref LL_PWR_PUPD_IO9
  *         @arg @ref LL_PWR_PUPD_IO10
  *         @arg @ref LL_PWR_PUPD_IO11
  *         @arg @ref LL_PWR_PUPD_IO12
  *         @arg @ref LL_PWR_PUPD_IO13
  *         @arg @ref LL_PWR_PUPD_IO14
  *         @arg @ref LL_PWR_PUPD_IO15
  * @retval State of bit (1 or 0).
  *         LL_PWR_PUPD_IO9, LL_PWR_PUPD_IO10, LL_PWR_PUPD_IO11
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledPDB(uint32_t IO)
{
  return ((READ_BIT(PWR->PDCRB, IO) == (IO)) ? 1UL : 0UL);
}

/**
  * @brief  Configure the IO in NO PULL configuration for port B.
  * @rmtoll PDCRB/PUCRB               LL_PWR_SetNoPullB
  * @param  GPIOx GPIO Port
  * @param  IO Pins Pull-down disable. This parameter can be a combination of the following values:
  *         @arg @ref LL_PWR_PUPD_IO0
  *         @arg @ref LL_PWR_PUPD_IO1
  *         @arg @ref LL_PWR_PUPD_IO2
  *         @arg @ref LL_PWR_PUPD_IO3
  *         @arg @ref LL_PWR_PUPD_IO4
  *         @arg @ref LL_PWR_PUPD_IO5
  *         @arg @ref LL_PWR_PUPD_IO6
  *         @arg @ref LL_PWR_PUPD_IO7
  *         @arg @ref LL_PWR_PUPD_IO8
  *         @arg @ref LL_PWR_PUPD_IO9
  *         @arg @ref LL_PWR_PUPD_IO10
  *         @arg @ref LL_PWR_PUPD_IO11
  *         @arg @ref LL_PWR_PUPD_IO12
  *         @arg @ref LL_PWR_PUPD_IO13
  *         @arg @ref LL_PWR_PUPD_IO14
  *         @arg @ref LL_PWR_PUPD_IO15
  * @retval None
  *         LL_PWR_PUPD_IO9, LL_PWR_PUPD_IO10, LL_PWR_PUPD_IO11
  */
__STATIC_INLINE void LL_PWR_SetNoPullB(uint32_t IO)
{
  CLEAR_BIT(PWR->PUCRB, IO);
  CLEAR_BIT(PWR->PDCRB, IO);
}

#if defined(PWR_IOxCFG_IOCFG4)
/**
  * @brief  Set PA4 during DEEPSTOP mode.
  * @rmtoll IOxCFG               LL_PWR_SetPA4OutputinDEEPSTOP
  * @param  mode This parameter can be one of the following values:
  *         @arg @ref LL_PWR_IOCFG_BYP
  *         @arg @ref LL_PWR_IOCFG_RTC
  *         @arg @ref LL_PWR_IOCFG_LOW
  *         @arg @ref LL_PWR_IOCFG_HIGH
  * @retval None
  */
__STATIC_INLINE void LL_PWR_SetPA4OutputinDEEPSTOP(uint32_t mode)
{
  MODIFY_REG_FIELD(PWR->IOxCFG, PWR_IOxCFG_IOCFG4, mode);
}

/**
  * @brief  Get PA4 output during DEEPSTOP mode.
  * @rmtoll IOxCFG               LL_PWR_GetPA4OutputinDEEPSTOP
  * @retval This parameter can be one of the following values:
  *         @arg @ref LL_PWR_IOCFG_BYP
  *         @arg @ref LL_PWR_IOCFG_RTC
  *         @arg @ref LL_PWR_IOCFG_LOW
  *         @arg @ref LL_PWR_IOCFG_HIGH
  */
__STATIC_INLINE uint32_t LL_PWR_GetPA4OutputinDEEPSTOP(void)
{
  return (uint32_t) (READ_BIT(PWR->IOxCFG, PWR_IOxCFG_IOCFG4) >> PWR_IOxCFG_IOCFG4_Pos);
}
#endif

#if defined(PWR_IOxCFG_IOCFG5)
  /**
  * @brief  Set PA5 during DEEPSTOP mode.
  * @rmtoll IOxCFG               LL_PWR_SetPA5OutputinDEEPSTOP
  * @param  mode This parameter can be one of the following values:
  *         @arg @ref LL_PWR_IOCFG_BYP
  *         @arg @ref LL_PWR_IOCFG_LCO
  *         @arg @ref LL_PWR_IOCFG_LOW
  *         @arg @ref LL_PWR_IOCFG_HIGH
  * @retval None
  */
__STATIC_INLINE void LL_PWR_SetPA5OutputinDEEPSTOP(uint32_t mode)
{
  MODIFY_REG_FIELD(PWR->IOxCFG, PWR_IOxCFG_IOCFG5, mode);
}

/**
  * @brief  Get PA5 output during DEEPSTOP mode.
  * @rmtoll IOxCFG               LL_PWR_GetPA5OutputinDEEPSTOP
  * @retval This parameter can be one of the following values:
  *         @arg @ref LL_PWR_IOCFG_BYP
  *         @arg @ref LL_PWR_IOCFG_LCO
  *         @arg @ref LL_PWR_IOCFG_LOW
  *         @arg @ref LL_PWR_IOCFG_HIGH
  */
__STATIC_INLINE uint32_t LL_PWR_GetPA5OutputinDEEPSTOP(void)
{
  return (uint32_t) (READ_BIT(PWR->IOxCFG, PWR_IOxCFG_IOCFG5) >> PWR_IOxCFG_IOCFG5_Pos);
}
#endif

#if defined(PWR_IOxCFG_IOCFG6)
/**
  * @brief  Set PA6 during DEEPSTOP mode.
  * @rmtoll IOxCFG               LL_PWR_SetPA6OutputinDEEPSTOP
  * @param  mode This parameter can be one of the following values:
  *         @arg @ref LL_PWR_IOCFG_BYP
  *         @arg @ref LL_PWR_IOCFG_LCO
  *         @arg @ref LL_PWR_IOCFG_LOW
  *         @arg @ref LL_PWR_IOCFG_HIGH
  * @retval None
  */
__STATIC_INLINE void LL_PWR_SetPA6OutputinDEEPSTOP(uint32_t mode)
{
  MODIFY_REG_FIELD(PWR->IOxCFG, PWR_IOxCFG_IOCFG6, mode);
}

/**
  * @brief  Get PA6 output during DEEPSTOP mode.
  * @rmtoll IOxCFG               LL_PWR_GetPA6OutputinDEEPSTOP
  * @retval This parameter can be one of the following values:
  *         @arg @ref LL_PWR_IOCFG_BYP
  *         @arg @ref LL_PWR_IOCFG_LCO
  *         @arg @ref LL_PWR_IOCFG_LOW
  *         @arg @ref LL_PWR_IOCFG_HIGH
  */
__STATIC_INLINE uint32_t LL_PWR_GetPA6OutputinDEEPSTOP(void)
{
  return (uint32_t) (READ_BIT(PWR->IOxCFG, PWR_IOxCFG_IOCFG6) >> PWR_IOxCFG_IOCFG6_Pos);
}
#endif

#if defined(PWR_IOxCFG_IOCFG7)
/**
  * @brief  Set PA7 during DEEPSTOP mode.
  * @rmtoll IOxCFG               LL_PWR_SetPA7OutputinDEEPSTOP
  * @param  mode This parameter can be one of the following values:
  *         @arg @ref LL_PWR_IOCFG_BYP
  *         @arg @ref LL_PWR_IOCFG_RTC
  *         @arg @ref LL_PWR_IOCFG_LOW
  *         @arg @ref LL_PWR_IOCFG_HIGH
  * @retval None
  */
__STATIC_INLINE void LL_PWR_SetPA7OutputinDEEPSTOP(uint32_t mode)
{
  MODIFY_REG_FIELD(PWR->IOxCFG, PWR_IOxCFG_IOCFG7, mode);
}

/**
  * @brief  Get PA7 output during DEEPSTOP mode.
  * @rmtoll IOxCFG               LL_PWR_GetPA7OutputinDEEPSTOP
  * @retval This parameter can be one of the following values:
  *         @arg @ref LL_PWR_IOCFG_BYP
  *         @arg @ref LL_PWR_IOCFG_RTC
  *         @arg @ref LL_PWR_IOCFG_LOW
  *         @arg @ref LL_PWR_IOCFG_HIGH
  */
__STATIC_INLINE uint32_t LL_PWR_GetPA7OutputinDEEPSTOP(void)
{
  return (uint32_t) (READ_BIT(PWR->IOxCFG, PWR_IOxCFG_IOCFG7) >> PWR_IOxCFG_IOCFG7_Pos);
}
#endif

