EduardoHM98/LoRaMac-node/src/boards/mcu/stm32/BlueNRG-LP/inc/rf_driver_ll_pwr.h
#if defined(PWR_IOxCFG_IOCFG0)
/**
  * @brief  Set PA8 during DEEPSTOP mode.
  * @rmtoll IOxCFG               LL_PWR_SetPA8OutputinDEEPSTOP
  * @param  mode This parameter can be one of the following values:
  *         @arg @ref LL_PWR_IOCFG_BYP
  *         @arg @ref LL_PWR_IOCFG_RTC
  *         @arg @ref LL_PWR_IOCFG_LOW
  *         @arg @ref LL_PWR_IOCFG_HIGH
  * @retval None
  */
__STATIC_INLINE void LL_PWR_SetPA8OutputinDEEPSTOP(uint32_t mode)
{
  MODIFY_REG_FIELD(PWR->IOxCFG, PWR_IOxCFG_IOCFG0, mode);
}

/**
  * @brief  Get PA8 output during DEEPSTOP mode.
  * @rmtoll IOxCFG               LL_PWR_GetPA8OutputinDEEPSTOP
  * @retval This parameter can be one of the following values:
  *         @arg @ref LL_PWR_IOCFG_BYP
  *         @arg @ref LL_PWR_IOCFG_RTC
  *         @arg @ref LL_PWR_IOCFG_LOW
  *         @arg @ref LL_PWR_IOCFG_HIGH
  */
__STATIC_INLINE uint32_t LL_PWR_GetPA8OutputinDEEPSTOP(void)
{
  return (uint32_t) (READ_BIT(PWR->IOxCFG, PWR_IOxCFG_IOCFG0) >> PWR_IOxCFG_IOCFG0_Pos);
}
#endif

#if defined(PWR_IOxCFG_IOCFG1)
/**
  * @brief  Set PA9 during DEEPSTOP mode.
  * @rmtoll IOxCFG               LL_PWR_SetPA9OutputinDEEPSTOP
  * @param  mode This parameter can be one of the following values:
  *         @arg @ref LL_PWR_IOCFG_BYP
  *         @arg @ref LL_PWR_IOCFG_LCO
  *         @arg @ref LL_PWR_IOCFG_LOW
  *         @arg @ref LL_PWR_IOCFG_HIGH
  * @retval None
  */
__STATIC_INLINE void LL_PWR_SetPA9OutputinDEEPSTOP(uint32_t mode)
{
  MODIFY_REG_FIELD(PWR->IOxCFG, PWR_IOxCFG_IOCFG1, mode);
}

/**
  * @brief  Get PA9 output during DEEPSTOP mode.
  * @rmtoll IOxCFG               LL_PWR_GetPA9OutputinDEEPSTOP
  * @retval This parameter can be one of the following values:
  *         @arg @ref LL_PWR_IOCFG_BYP
  *         @arg @ref LL_PWR_IOCFG_LCO
  *         @arg @ref LL_PWR_IOCFG_LOW
  *         @arg @ref LL_PWR_IOCFG_HIGH
  */
__STATIC_INLINE uint32_t LL_PWR_GetPA9OutputinDEEPSTOP(void)
{
  return (uint32_t)(READ_BIT(PWR->IOxCFG, PWR_IOxCFG_IOCFG1) >> PWR_IOxCFG_IOCFG1_Pos);
}
#endif

#if defined(PWR_IOxCFG_IOCFG2)
/**
  * @brief  Set PA10 during DEEPSTOP mode.
  * @rmtoll IOxCFG               LL_PWR_SetPA10OutputinDEEPSTOP
  * @param  mode This parameter can be one of the following values:
  *         @arg @ref LL_PWR_IOCFG_BYP
  *         @arg @ref LL_PWR_IOCFG_LCO
  *         @arg @ref LL_PWR_IOCFG_LOW
  *         @arg @ref LL_PWR_IOCFG_HIGH
  * @retval None
  */
__STATIC_INLINE void LL_PWR_SetPA10OutputinDEEPSTOP(uint32_t mode)
{
  MODIFY_REG_FIELD(PWR->IOxCFG, PWR_IOxCFG_IOCFG2, mode);
}

/**
  * @brief  Get PA10 output during DEEPSTOP mode.
  * @rmtoll IOxCFG               LL_PWR_GetPA10OutputinDEEPSTOP
  * @retval This parameter can be one of the following values:
  *         @arg @ref LL_PWR_IOCFG_BYP
  *         @arg @ref LL_PWR_IOCFG_LCO
  *         @arg @ref LL_PWR_IOCFG_LOW
  *         @arg @ref LL_PWR_IOCFG_HIGH
  */
__STATIC_INLINE uint32_t LL_PWR_GetPA10OutputinDEEPSTOP(void)
{
  return (uint32_t)(READ_BIT(PWR->IOxCFG, PWR_IOxCFG_IOCFG2) >> PWR_IOxCFG_IOCFG2_Pos);
}
#endif

#if defined(PWR_IOxCFG_IOCFG3)
/**
  * @brief  Set PA11 during DEEPSTOP mode.
  * @rmtoll IOxCFG               LL_PWR_SetPA11OutputinDEEPSTOP
  * @param  mode This parameter can be one of the following values:
  *         @arg @ref LL_PWR_IOCFG_BYP
  *         @arg @ref LL_PWR_IOCFG_RTC
  *         @arg @ref LL_PWR_IOCFG_LOW
  *         @arg @ref LL_PWR_IOCFG_HIGH
  * @retval None
  */
__STATIC_INLINE void LL_PWR_SetPA11OutputinDEEPSTOP(uint32_t mode)
{
  MODIFY_REG_FIELD(PWR->IOxCFG, PWR_IOxCFG_IOCFG3, mode);
}

/**
  * @brief  Get PA11 output during DEEPSTOP mode.
  * @rmtoll IOxCFG               LL_PWR_GetPA11OutputinDEEPSTOP
  * @retval This parameter can be one of the following values:
  *         @arg @ref LL_PWR_IOCFG_BYP
  *         @arg @ref LL_PWR_IOCFG_RTC
  *         @arg @ref LL_PWR_IOCFG_LOW
  *         @arg @ref LL_PWR_IOCFG_HIGH
  */
__STATIC_INLINE uint32_t LL_PWR_GetPA11OutputinDEEPSTOP(void)
{
  return (uint32_t) (READ_BIT(PWR->IOxCFG, PWR_IOxCFG_IOCFG3) >> PWR_IOxCFG_IOCFG3_Pos);
}
#endif

/**
  * @brief  Set SMPS trimming value.
  * @rmtoll ENGTRIM               LL_PWR_SetSMPSTrim
  * @param  trim SMPS output voltage trimming value
  * @retval None
  */
__STATIC_INLINE void LL_PWR_SetSMPSTrim(uint32_t trim)
{
  MODIFY_REG(PWR->ENGTRIM, PWR_ENGTRIM_SMPS_TRIM, ((trim << PWR_ENGTRIM_SMPS_TRIM_Pos) & PWR_ENGTRIM_SMPS_TRIM));
  SET_BIT(PWR->ENGTRIM, PWR_ENGTRIM_SMPSTRIMEN);
}

/**
  * @brief  Get SMPS trimming value.
  * @rmtoll TRIMR/ENGTRIM               LL_PWR_GetSMPSTrim
  * @retval SMPS output voltage trimming value
  */
__STATIC_INLINE uint32_t LL_PWR_GetSMPSTrim(void)
{
  if (READ_BIT(PWR->ENGTRIM, PWR_ENGTRIM_SMPSTRIMEN)) {
    return (uint32_t) (READ_BIT(PWR->ENGTRIM, PWR_ENGTRIM_SMPS_TRIM) >> PWR_ENGTRIM_SMPS_TRIM_Pos);
  } else {
    return (uint32_t) (READ_BIT(PWR->TRIMR, PWR_TRIMR_SMPS_TRIM) >> PWR_TRIMR_SMPS_TRIM_Pos);
  }
}

/**
  * @brief  Set Main regulator voltage trimming value.
  * @rmtoll ENGTRIM               LL_PWR_SetMRTrim
  * @param  trim Main Regulator voltage trimming value
  * @retval None
  */
__STATIC_INLINE void LL_PWR_SetMRTrim(uint32_t trim)
{
  MODIFY_REG(PWR->ENGTRIM, PWR_ENGTRIM_TRIM_MR, ((trim << PWR_ENGTRIM_TRIM_MR_Pos) & PWR_ENGTRIM_TRIM_MR));
  SET_BIT(PWR->ENGTRIM, PWR_ENGTRIM_TRIMMREN);
}

/**
  * @brief  Get Main regulator voltage trimming value.
  * @rmtoll TRIMR/ENGTRIM               LL_PWR_GetMRTrim
  * @retval Main regulator voltage trimming value
  */
__STATIC_INLINE uint32_t LL_PWR_GetMRTrim(void)
{
  if (READ_BIT(PWR->ENGTRIM, PWR_ENGTRIM_TRIMMREN)) {
    return (uint32_t) (READ_BIT(PWR->ENGTRIM, PWR_ENGTRIM_TRIM_MR) >> PWR_ENGTRIM_TRIM_MR_Pos);
  } else {
    return (uint32_t) (READ_BIT(PWR->TRIMR, PWR_TRIMR_TRIM_MR) >> PWR_TRIMR_TRIM_MR_Pos);
  }
}

#if defined(PWR_ENGTRIM_TRIM_LSI_LPMU) 
/**
  * @brief  Set Low Speed Internal oscillator LPMU trimming value.
  * @rmtoll ENGTRIM               LL_PWR_SetLPMULSITrim
  * @param  trim Low Speed Internal oscillator trimming value
  * @retval None
  */
__STATIC_INLINE void LL_PWR_SetLSILPMUTrim(uint32_t trim)
{
  MODIFY_REG(PWR->ENGTRIM, PWR_ENGTRIM_TRIM_LSI_LPMU, ((trim << PWR_ENGTRIM_TRIM_LSI_LPMU_Pos) & PWR_ENGTRIM_TRIM_LSI_LPMU));
  SET_BIT(PWR->ENGTRIM, PWR_ENGTRIM_TRIMLSILPMUEN);
}

/**
  * @brief  Get Low Speed Internal oscillator LPMU trimming value.
  * @rmtoll TRIMR/ENGTRIM               LL_PWR_GetLSITrim
  * @retval Low Speed Internal oscillator trimming value
  */
__STATIC_INLINE uint32_t LL_PWR_GetLSILPMUTrim(void)
{
  if (READ_BIT(PWR->ENGTRIM, PWR_ENGTRIM_TRIMLSILPMUEN)) {
    return (uint32_t) (READ_BIT(PWR->ENGTRIM, PWR_ENGTRIM_TRIM_LSI_LPMU) >> PWR_ENGTRIM_TRIM_LSI_LPMU_Pos);
  } else {
    return (uint32_t) (READ_BIT(PWR->TRIMR, PWR_TRIMR_TRIM_LSI_LPMU) >> PWR_TRIMR_TRIM_LSI_LPMU_Pos);
  }
}
#endif

#if defined(PWR_ENGTRIM_TRIM_RFDREG) 
/**
  * @brief  Set RF LDO trimming value.
  * @rmtoll ENGTRIM               LL_PWR_SetRFDREGTrim
  * @param  trim RF LDO trimming value
  * @retval None
  */
__STATIC_INLINE void LL_PWR_SetRFDREGTrim(uint32_t trim)
{
  MODIFY_REG(PWR->ENGTRIM, PWR_ENGTRIM_TRIM_RFDREG, ((trim << PWR_ENGTRIM_TRIM_RFDREG_Pos) & PWR_ENGTRIM_TRIM_RFDREG));
  SET_BIT(PWR->ENGTRIM, PWR_ENGTRIM_TRIMRFDREGEN);
}

/**
  * @brief  Get RF LDO trimming value.
  * @rmtoll TRIMR/ENGTRIM               LL_PWR_GetRFDREGTrim
  * @retval RF LDO trimming value
  */
__STATIC_INLINE uint32_t LL_PWR_GetRFDREGTrim(void)
{
  if (READ_BIT(PWR->ENGTRIM, PWR_ENGTRIM_TRIMRFDREGEN)) {
    return (uint32_t) (READ_BIT(PWR->ENGTRIM, PWR_ENGTRIM_TRIM_RFDREG) >> PWR_ENGTRIM_TRIM_RFDREG_Pos);
  } else {
    return (uint32_t) (READ_BIT(PWR->TRIMR, PWR_TRIMR_RFD_REG_TRIM) >> PWR_TRIMR_RFD_REG_TRIM_Pos);
  }
}
#endif

/**
  * @}
  */

